In [1]:
import pandas as pd

# Stage 1/6: Load the data

## 1. Load the dataset from the JSON file;

In [4]:
df = pd.read_json('nobel_laureates.json')
df.head()

,born_in,category,country,date_of_birth,date_of_death,gender,link,name,place_of_birth,place_of_death,text,year
0,,Physiology or Medicine,Argentina,8 October 1927,24 March 2002,male,http://en.wikipedia.org/wiki/C%C3%A9sar_Milstein,César Milstein,"Bahía Blanca , Argentina","Cambridge , England","César Milstein , Physiology or Medicine, 1984",1984
1,Bosnia and Herzegovina,Literature,,9 October 1892,13 March 1975,male,http://en.wikipedia.org/wiki/Ivo_Andric,Ivo Andric *,"Dolac (village near Travnik), Bosnia and Herze...","Belgrade, SR Serbia, SFR Yugoslavia (present-d...","Ivo Andric *, born in then Austria–Hungary ,...",1961
2,Bosnia and Herzegovina,Chemistry,,"July 23, 1906",1998-01-07,male,http://en.wikipedia.org/wiki/Vladimir_Prelog,Vladimir Prelog *,"Sarajevo , Bosnia and Herzegovina","Zürich , Switzerland","Vladimir Prelog *, born in then Austria–Hung...",1975
3,,Peace,Belgium,None,None,None,http://en.wikipedia.org/wiki/Institut_de_Droit...,Institut de Droit International,None,None,"Institut de Droit International , Peace, 1904",1904
4,,Peace,Belgium,26 July 1829,6 October 1912,male,http://en.wikipedia.org/wiki/Auguste_Marie_Fra...,Auguste Beernaert,"Ostend , Belgium","Lucerne , Switzerland","Auguste Beernaert , Peace, 1909",1909

## 2. Explore the data and check what the axes are, get the shape of the DataFrame, use .info() to check for the data types and whether there are any missing values;

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1052 entries, 0 to 1051
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   born_in         1052 non-null   object
 1   category        1052 non-null   object
 2   country         1052 non-null   object
 3   date_of_birth   1044 non-null   object
 4   date_of_death   1044 non-null   object
 5   gender          1040 non-null   object
 6   link            1052 non-null   object
 7   name            1052 non-null   object
 8   place_of_birth  1011 non-null   object
 9   place_of_death  1044 non-null   object
 10  text            1052 non-null   object
 11  year            1052 non-null   int64
dtypes: int64(1), object(11)
memory usage: 106.8+ KB

In [6]:
df.isna().sum()

born_in            0
category           0
country            0
date_of_birth      8
date_of_death      8
gender            12
link               0
name               0
place_of_birth    41
place_of_death     8
text               0
year               0
dtype: int64

In [8]:
df[df.isna()]

,born_in,category,country,date_of_birth,date_of_death,gender,link,name,place_of_birth,place_of_death,text,year
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,None,None,None,NaN,NaN,None,None,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
1047,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1048,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1049,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1050,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1051,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## 3. Use the .duplicated() method to check whether there are any duplicate rows. Print False if there are no duplicate rows, otherwise print True.

In [11]:
duplicated_rows = df[df.duplicated()]
if len(duplicated_rows) > 0:
    print(True)
else:
    print(False)

True

## 4. Drop all the rows where the gender column does not contain any values. Hint: use the subset parameter of the .dropna() method in pandas.

In [14]:
print(df.gender.unique())

['male' None 'female']

In [16]:
df2 = df.dropna(how='all', subset=['gender'])
print(df2.gender.unique())

['male' 'female']

## 5. Re-index the DataFrame so that the index contains consecutive numbers. Do not forget to remove the old index column.

In [24]:
df3 = df2.reset_index(drop=True)

1040

In [25]:
df3[['country', 'name']].head(20).to_dict()

{'country': {0: 'Argentina',
  1: '',
  2: '',
  4: 'Belgium',
  5: 'Belgium',
  6: 'Belgium',
  7: 'Belgium',
  8: 'Belgium',
  9: 'Belgium',
  10: 'Belgium',
  11: 'Belgium',
  12: 'Belgium',
  13: 'Belgium',
  14: '',
  15: '',
  16: '',
  17: 'Denmark',
  18: 'Denmark',
  19: 'Denmark',
  20: 'Denmark'},
 'name': {0: 'César Milstein',
  1: 'Ivo Andric *',
  2: 'Vladimir Prelog *',
  4: 'Auguste Beernaert',
  5: 'Maurice Maeterlinck',
  6: 'Henri La Fontaine',
  7: 'Jules Bordet',
  8: 'Corneille Heymans',
  9: 'Georges Pire',
  10: 'Albert Claude',
  11: 'Christian de Duve',
  12: 'Ilya Prigogine',
  13: 'François Englert',
  14: 'Simon Kuznets *',
  15: 'Menachem Begin *',
  16: 'Shimon Peres *',
  17: 'Karl Adolph Gjellerup',
  18: 'August Krogh',
  19: 'Niels Bohr',
  20: 'Johannes Andreas Grib Fibiger'}}

# Stage 2/6: Correct the birthplaces
Some values in the born_in column are missing. Correct them with the place_of_birth column values.

## 1. Extract the country names from the place_of_birth column. Typically, this column contains the name of the city and, sometimes, state and country of birth. The values are separated by a comma. To extract the country, split each column value by comma (if it is present) and take the last value. Apply .strip() to the Python string to remove the excessive white spaces. If no comma is present in the column value, replace the value with None;

In [28]:
df = df3.copy()
df[['born_in', 'place_of_birth']].head()

                  born_in                                     place_of_birth
0                                                  Bahía Blanca ,  Argentina
1  Bosnia and Herzegovina  Dolac (village near Travnik), Bosnia and Herze...
2  Bosnia and Herzegovina                 Sarajevo ,  Bosnia and Herzegovina
4                                                          Ostend ,  Belgium
5                                                           Ghent ,  Belgium

In [34]:
# if place_of_birth has a comma, then split each value by comma and take the last value
df['place_of_birth_clean'] = df['place_of_birth'].apply(lambda x: x.split(',')[-1].strip() if isinstance(x, str) and ',' in x else None)
df[['born_in', 'place_of_birth', 'place_of_birth_clean']].head()

,born_in,place_of_birth,place_of_birth_clean
0,,"Bahía Blanca , Argentina",Argentina
1,Bosnia and Herzegovina,"Dolac (village near Travnik), Bosnia and Herze...",Bosnia and Herzegovina
2,Bosnia and Herzegovina,"Sarajevo , Bosnia and Herzegovina",Bosnia and Herzegovina
4,,"Ostend , Belgium",Belgium
5,,"Ghent , Belgium",Belgium

## 2. Fill the born_in empty values with the new values of the place_of_birth column. If the born_in column still contains empty values, drop the respective rows. Reset the DataFrame index;

In [39]:
df['born_in'] = df['born_in'].replace('', None)
df['born_in'] = df['born_in'].fillna(df['place_of_birth_clean'])
df[['born_in', 'place_of_birth', 'place_of_birth_clean']].head()

,born_in,place_of_birth,place_of_birth_clean
0,Argentina,"Bahía Blanca , Argentina",Argentina
1,Bosnia and Herzegovina,"Dolac (village near Travnik), Bosnia and Herze...",Bosnia and Herzegovina
2,Bosnia and Herzegovina,"Sarajevo , Bosnia and Herzegovina",Bosnia and Herzegovina
4,Belgium,"Ostend , Belgium",Belgium
5,Belgium,"Ghent , Belgium",Belgium

In [48]:
print(len(df[df['born_in'].isna()]))
df = df.dropna(subset=['born_in']).reset_index(drop=True)
print(len(df[df['born_in'].isna()]))

0
0

## 3. Modify the names of countries — replace US, United States, and U.S. with USA, and United Kingdom with UK.

In [51]:
# sorted(df.country.unique())

In [60]:
replacement_dict = {
        'US': 'USA',
        'United States': 'USA',
        'U.S.': 'USA',
        'United Kingdom': 'UK'
    }
df['born_in'] = df['born_in'].replace(replacement_dict)

In [62]:
# output a list of born_in column values.
# sorted(list(df['born_in'].unique()))

# Stage 3/6: